export const aboutText = {
  description: [
    "微精弘是是碎片化、一站式、一体化校园移动门户，适用于浙江工业大学学生，集课表、成绩、考试、空教室、一卡通、借阅等功能于一身。",
    "微精弘有更好用的课表查询，本周视图、学期视图、对应日期及时钟轴，清晰明了",
    "微精弘有更方便的考试安排，帮你折算出考试周对应的日期，以及考试时间倒计时，一目了然。",
    "微精弘还是校园生活助手与管家，一卡通余额及消费一览无余，让同学们更合理安排生活费。微精弘更是/更有...（期待您的发现）"
  ]
};
export const labText = {
  empty: "当前没有实验功能，尽情期待！😚"
};
export const settingText = {
  empty: "更多设置功能，尽情期待！😚"
};
export const faqText = {
  qa: [
    {
      title: "我一直空课表或课表报错，怎么办？",
      content:
        "1. 首先检查一下网络连接。\n2. 假如是空课表，没有报错，请检查一下当前学期是否正确。\n3. 切换学期：右下角「期/周」切换，然后在下方进行切换学期。\n4. 假如有报错，可能是因为修改过正方教务系统密码而导致课表未能同步，请前往「我的-绑定-正方账号」重新填写正方密码进行绑定操作。\n5. 回到首页自动刷新。\n"
    },
    {
      title: "遇到了「用户名或密码错误」",
      content:
        "请前往「我的-绑定-正方账号」重新填写正方密码进行绑定操作。\n（考试安排等重要信息可以截图保存喔）"
    },
    {
      title: "关于数据来源的说明",
      content:
        "课程表、校园卡余额、借阅信息等数据全部来自正方、容大后勤、图书馆系统，有任何数据错误问题可以直接联系教务处、容大后勤或图书馆。"
    },
    {
      title: "校园卡余额为什么没有同步更新",
      content:
        "1. 校园卡本身不联网，和线上的数据同步依靠打卡机。但校内有部分打卡机（如校车、移动早餐点）不联网，所以在这些地方刷卡后在网上查询流水是没有记录的，校园卡在接触联网的打卡机后数据会自动同步到线上。\n2. 如果余额和交易数据空白或长期没有更新，可能是因为修改过校园卡密码而导致数据未能同步，请前往「我的-绑定-校园卡」重新填写校园卡密码进行绑定操作。"
    },
    {
      title: "遇到「正方服务器出错」请怼教务处",
      content:
        "选课：85290019\n资源管理（教室借用）：85290020\n教务管理（重考、重修、学生证补办、订火车票、申请旁听课）：85290029"
    },
    {
      title: "正方教务系统的密码是什么？",
      content:
        "这个密码到底是什么？就是你们自己的教务系统账号的密码喔~\n选课、查成绩、教学过程评价用的都是正方教务系统这个密码，初始密码是身份证号后六位。\n要是忘记了自己的教务系统密码可以去学院教务处重置哦~\n"
    },
    {
      title: "问题紧急请添加反馈 QQ 群",
      content: "721519763（三群）"
    }
  ]
};
export const helpText = {
  lessonsTable:
    "若课表长时间无法更新或总是刷新失败，可能是因为更改过正方教务系统密码，请前往我的-绑定-重新绑定正方账号。",
  schoolCard:
    "若余额或交易记录长时间无法更新或总是刷新失败，可能是因为更改过校园卡密码，请前往我的-绑定-重新绑定校园卡账号。",
  scoreCard:
    "若信息长时间无法更新或总是刷新失败，可能是因为更改过正方教务系统的密码，请前往我的-绑定-重新绑定正方账号。\n       成绩查询中的信息全部来自正方教务系统，数据录入可能会有延迟，请耐心等待。\n       如有疑问请联系教务处，本程序仅作信息展示。",
  bind: {
    zf: "1.正方教务系统是什么？\n正方教务系统是你的选课系统哦~\n那么密码就是你的选课密码~\n\n2.忘记密码？\n请联系学院教务老师重置密码。",
    oauth: "1.统一验证系统是什么？\n统一验证系统是你的选课系统哦~\n那么密码就是你的统一验证密码~\n\n2.忘记密码？\n请联系学院教务老师重置密码。 \n\n 23级及以后的同学改用统一验证系统登录",
    library:
      "新生图书馆绑定异常——新生需要在接受图书馆培训并通过入馆考试后，才能正常绑定图书馆账号",
    yxy: "丨绑定此项以使用校园卡查询等功能\n丨请确保已下载过易校园 APP 且将手机号与学号、宿舍绑定\n丨若图形验证码加载失败，请过一段时间再来绑定"
  },
  exam: "丨微精弘的数据全部来源于正方教务系统，如果有误，请向正方教务系统提出更正意见。\n丨考试信息以实际为准，常见考试时长是2h，但也有部分考试时长为1.5h，请大家务必仔细注意考场黑板上的考试时间噢～",
  examCard: "若信息长时间无法更新或总是刷新失败，可能是因为更改过正方教务系统的密码，请前往我的-绑定-重新绑定正方账号。\n丨考试安排中的信息全部来自正方教务系统，数据录入可能会有延迟，请耐心等待。如有疑问请联系教务处，本程序仅作信息展示。\n丨仅展示 近3日 的考试",
  activtion:
    "因微精弘改版更新，老用户需要重新对微精弘账号进行激活操作，重新设置的密码将作为账号新密码，万望理解。如遇长时间加载可退出重试或删除小程序重新进入（如有疑问请加群 721519763 ）",
  score:
    "因各学院实际绩点计算标准不一，微精弘绩点算法将特殊科目（包括通识课和体育课）成绩也纳入计算，且缓考、补考、重修、免修的成绩不纳入计算，计算结果仅供参考，数据来源于正方教务系统。",
  lostfound:
    "首页“失物寻物”模块是由“For You”工程与精弘网络合作共同开发的一项学生服务功能，若丢失或拾得物品请联系界面底部上拉列表的组织管理员。您的参与是对我们工作的最大支持，让我们携手共同营造温暖、团结的校园氛围。",
  suit: {
    main: "“正装借用”是由学生事务大厅与精弘网络合作共同开发的一项学生服务功能，您的参与是对我们工作的最大支持，让我们携手共同营造温暖、团结的校园氛围。",
    help: "感谢您使用由学生事务大厅与精弘网络合作共同开发的“正装借用”，使用时如有疑问请点击您所在的校区，查看详情中“学生事务大厅”的联系方式咨询工作人员。",
    information: "感谢您使用由学生事务大厅与精弘网络合作共同开发的“正装借用”，请在使用前正确填写您的真实个人信息，以便后续工作的开展。",
    warn: "请您再次确认是否提交申请！提交申请后正装请到学生事务大厅领取，领取后将变为申请中状态（建议线下确认尺码后当场提交申请）\n       “余量不足”的正装可能会被线下借用的同学优先借完，从而导致在“微精弘线上借用”已经申请过的同学无正装可借，微精弘对此概不负责！"
  },
  logout: {
    main: "| 您的微精弘账号一旦被注销成功将无法再找回您添加、绑定的任何本账号内容或信息!  若您在注销后仍需要使用微精弘，请重新打开小程序按照“激活”的步骤创建微精弘账号，感谢您的配合！",
    check: "注销操作将清除您的在微精弘激活的所有个人信息以及绑定数据，请您确认是否要注销账号？"
  },
  changePassword: "请确定您已经记住了新密码，以免忘记密码后无法再次登录，是否确认修改？"
};
