export const aboutText = {
  description: [
    '微精弘是是碎片化、一站式、一体化校园移动门户，适用于浙江工业大学学生，集课表、成绩、考试、空教室、一卡通、借阅等功能于一身。',
    '微精弘有更好用的课表查询，本周视图、学期视图、对应日期及时钟轴，清晰明了',
    '微精弘有更方便的考试安排，帮你折算出考试周对应的日期，以及考试时间倒计时，一目了然。',
    '微精弘还是校园生活助手与管家，一卡通余额及消费一览无余，让同学们更合理安排生活费。微精弘更是/更有...（期待您的发现）'
  ]
};
export const labText = {
  empty: '当前没有实验功能，尽情期待！😚'
};
export const settingText = {
  empty: '当前没有可设置功能，尽情期待！😚'
};
export const faqText = {
  qa: [
    {
      title: '我一直空课表或课表报错，怎么办？',
      content:
        '1. 首先检查一下网络连接\n2. 假如是空课表，没有报错，请检查一下当前学期是否正确\n3. 切换学期：右下角「期/周」切换，然后点击下方箭头进行切换学期\n4. 假如有报错，请前往「我的-设置-绑定正方」重新填写正方密码进行绑定操作\n5. 然后回到首页下拉刷新'
    },
    {
      title: '遇到了「用户名或密码错误」',
      content:
        '请去「我的」-「设置」–「绑定正方密码」，重新绑定正方教务系统密码,最近正方老是出错，请各位用户勤截图，特别是排考'
    },
    {
      title: '关于半夜被刷卡/非自己刷卡等校园卡问题',
      img: {
        url: 'https://assets.gettoset.cn/wejh/qna-card.jpg',
        height: '600px'
      }
    },
    {
      title: '遇到「正方服务器出错」请怼教务处',
      content:
        '教务处\n选课：5290019\n资源管理（教室借用）：85290020\n教务管理（重考、重修、学生证补办、订火车票、申请旁听课）：85290029'
    },
    {
      title: '正方教务系统的密码是什么？',
      content:
        '这个密码到底是什么？当然是你们自己的教务系统账号的密码啦～\n选课调课查成绩用的都是正方教务系统这个密码，你来问我我也只能告诉你初始密码是身份证号后六位\n至于你现在的密码是什么我也不知道总不能要我来帮你操作吧\n当然啦，要是忘记了自己的教务系统密码可以去学院教务处重置哦～'
    },
    {
      title: '问题紧急请添加反馈 QQ 群',
      content: '462530805（一群)\n282402782（二群)'
    }
  ]
};
export const helpText = {
  lessonsTable:
    '若课表长时间无法更新或总是刷新失败，可能是因为更改过正方教务系统密码，请前往我的-绑定-重新绑定正方账号。',
  schoolCard:
    '若余额或交易记录长时间无法更新或总是刷新失败，可能是因为更改过校园卡密码，请前往我的-绑定-重新绑定校园卡账号。'
};
